apache/nuttx/arch/arm/src/imxrt/imxrt_flexpwm.c
/****************************************************************************
 * arch/arm/src/imxrt/imxrt_flexpwm.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <unistd.h>
#include <time.h>
#include <string.h>
#include <nuttx/debug.h>
#include <errno.h>

#include <nuttx/timers/pwm.h>

#include "arm_internal.h"
#include "chip.h"
#include "imxrt_config.h"
#include "imxrt_flexpwm.h"
#include "imxrt_gpio.h"
#include "imxrt_periphclks.h"
#include "imxrt_xbar.h"
#include "hardware/imxrt_flexpwm.h"
#include "hardware/imxrt_pinmux.h"
#include "hardware/imxrt_ccm.h"

#include <arch/board/board.h>

#include <sys/time.h>

#ifdef CONFIG_IMXRT_FLEXPWM

#ifdef CONFIG_PWM_NCHANNELS
#  define PWM_NCHANNELS CONFIG_PWM_NCHANNELS
#else
#  define PWM_NCHANNELS 1
#endif

#define MODULE_OFFSET 0x60
#define CLK_FREQ  150000000
#define PWM_RES 65535

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct imxrt_flexpwm_out_s
{
  bool used;
  uint32_t pin;                     /* Output pin */
};

struct imxrt_flexpwm_module_s
{
  uint8_t module;                   /* Number of PWM module */
  bool used;                        /* True if the module is used */
  uint8_t trig_val;                 /* 0: invalid, 1: period, 2: duty */
  struct imxrt_flexpwm_out_s out_a; /* PWM output */
  struct imxrt_flexpwm_out_s out_b; /* PWM output */
  bool complementary;               /* True if outputs are complementary */
  uint32_t irq;                     /* Combined interrupt */
  uint16_t ext_sync;
  int16_t sync_src;
};

struct imxrt_flexpwm_s
{
  const struct pwm_ops_s *ops;      /* PWM operations */
  struct imxrt_flexpwm_module_s *modules;
  uint8_t modules_num;              /* Number of modules */
  uint32_t frequency;               /* PWM frequency */
  uint32_t base;                    /* Base address of peripheral register */
};

/* PWM driver methods */

static int pwm_setup(struct pwm_lowerhalf_s *dev);
static int pwm_shutdown(struct pwm_lowerhalf_s *dev);
static int pwm_start(struct pwm_lowerhalf_s *dev,
                     const struct pwm_info_s *info);
static int pwm_stop(struct pwm_lowerhalf_s *dev);
static int pwm_ioctl(struct pwm_lowerhalf_s *dev,
                     int cmd, unsigned long arg);

/* Helper functions */

static int pwm_set_output(struct pwm_lowerhalf_s *dev, uint8_t channel,
                          ub16_t duty);
static int pwm_change_freq(struct pwm_lowerhalf_s *dev,
                           const struct pwm_info_s *info,
                           uint8_t channel);

/****************************************************************************
  * Private Data
 ****************************************************************************/

static const struct pwm_ops_s g_pwmops =
{
  .setup      = pwm_setup,
  .shutdown   = pwm_shutdown,
  .start      = pwm_start,
  .stop       = pwm_stop,
  .ioctl      = pwm_ioctl,
};

#ifdef CONFIG_IMXRT_FLEXPWM1

static struct imxrt_flexpwm_module_s g_pwm1_modules[] =
{
  /* FlexPWM1 has 4 submodules with 2 outputs for each */

#ifdef CONFIG_IMXRT_FLEXPWM1_MOD1
  {
    .module = 1,
    .used = true,
#ifdef CONFIG_IMXRT_FLEXPWM1_MOD1_TRIG
#ifdef CONFIG_IMXRT_FLEXPWM1_MOD1_TRIG_PER
    .trig_val = 1,
#elif CONFIG_IMXRT_FLEXPWM1_MOD1_TRIG_DUTY
    .trig_val = 2,
#else
    .trig_val = 0,
#endif
#else
    .trig_val = 0,
#endif
    .out_a =
    {
      .used = true,
      .pin = GPIO_FLEXPWM1_MOD1_A
    },
#ifdef CONFIG_IMXRT_FLEXPWM1_MOD1_USE_OUT_B
    .out_b =
    {
      .used = true,
      .pin = GPIO_FLEXPWM1_MOD1_B
    },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM1_MOD1_COMP
    .complementary = true,
#else
    .complementary = false,
#endif
    .sync_src = CONFIG_IMXRT_FLEXPWM1_MOD1_SYNC_SRC,
    .ext_sync = IMXRT_XBARA1_OUT_FLEXPWM1_EXT_SYNC0_SEL_OFFSET,
  },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM1_MOD2
  {
    .module = 2,
    .used = true,
#ifdef CONFIG_IMXRT_FLEXPWM1_MOD2_TRIG
#ifdef CONFIG_IMXRT_FLEXPWM1_MOD2_TRIG_PER
    .trig_val = 1,
#elif CONFIG_IMXRT_FLEXPWM1_MOD2_TRIG_DUTY
    .trig_val = 2,
#else
    .trig_val = 0,
#endif
#else
    .trig_val = 0,
#endif
    .out_a =
    {
      .used = true,
      .pin = GPIO_FLEXPWM1_MOD2_A
    },
#ifdef CONFIG_IMXRT_FLEXPWM1_MOD2_USE_OUT_B
    .out_b =
    {
      .used = true,
      .pin = GPIO_FLEXPWM1_MOD2_B
    },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM1_MOD2_COMP
    .complementary = true,
#else
    .complementary = false,
#endif
    .sync_src = CONFIG_IMXRT_FLEXPWM1_MOD2_SYNC_SRC,
    .ext_sync = IMXRT_XBARA1_OUT_FLEXPWM1_EXT_SYNC1_SEL_OFFSET,
  },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM1_MOD3
  {
    .module = 3,
    .used = true,
#ifdef CONFIG_IMXRT_FLEXPWM1_MOD3_TRIG
#ifdef CONFIG_IMXRT_FLEXPWM1_MOD3_TRIG_PER
    .trig_val = 1,
#elif CONFIG_IMXRT_FLEXPWM1_MOD3_TRIG_DUTY
    .trig_val = 2,
#else
    .trig_val = 0,
#endif
#else
    .trig_val = 0,
#endif
    .out_a =
    {
      .used = true,
      .pin = GPIO_FLEXPWM1_MOD3_A
    },
#ifdef CONFIG_IMXRT_FLEXPWM1_MOD3_USE_OUT_B
    .out_b =
    {
      .used = true,
      .pin = GPIO_FLEXPWM1_MOD3_B
    },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM1_MOD3_COMP
    .complementary = true,
#else
    .complementary = false,
#endif
    .sync_src = CONFIG_IMXRT_FLEXPWM1_MOD3_SYNC_SRC,
    .ext_sync = IMXRT_XBARA1_OUT_FLEXPWM1_EXT_SYNC2_SEL_OFFSET,
  },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM1_MOD4
  {
    .module = 4,
    .used = true,
#ifdef CONFIG_IMXRT_FLEXPWM1_MOD4_TRIG
#ifdef CONFIG_IMXRT_FLEXPWM1_MOD4_TRIG_PER
    .trig_val = 1,
#elif CONFIG_IMXRT_FLEXPWM1_MOD4_TRIG_DUTY
    .trig_val = 2,
#else
    .trig_val = 0,
#endif
#else
    .trig_val = 0,
#endif
    .out_a =
    {
      .used = true,
      .pin = GPIO_FLEXPWM1_MOD4_A
    },
#ifdef CONFIG_IMXRT_FLEXPWM1_MOD4_USE_OUT_B
    .out_b =
    {
      .used = true,
      .pin = GPIO_FLEXPWM1_MOD4_B
    },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM1_MOD4_COMP
    .complementary = true,
#else
    .complementary = false,
#endif
    .sync_src = CONFIG_IMXRT_FLEXPWM1_MOD4_SYNC_SRC,
    .ext_sync = IMXRT_XBARA1_OUT_FLEXPWM1_EXT_SYNC3_SEL_OFFSET,
  },
#endif
};

