apache/nuttx/arch/arm/src/imxrt/imxrt_flexpwm.c
static struct imxrt_flexpwm_s g_pwm1 =
{
  .ops = &g_pwmops,
  .modules = g_pwm1_modules,
  .modules_num = FLEXPWM1_NMODULES,
  .frequency = 0,
  .base = IMXRT_FLEXPWM1_BASE,
};
#endif /* CONFIG_IMXRT_FLEXPWM1 */

#ifdef CONFIG_IMXRT_FLEXPWM2

static struct imxrt_flexpwm_module_s g_pwm2_modules[] =
{
  /* FlexPWM2 has 4 submodules with 2 outputs for each */

#ifdef CONFIG_IMXRT_FLEXPWM2_MOD1
  {
    .module = 1,
    .used = true,
#ifdef CONFIG_IMXRT_FLEXPWM2_MOD1_TRIG
#ifdef CONFIG_IMXRT_FLEXPWM2_MOD1_TRIG_PER
    .trig_val = 1,
#elif CONFIG_IMXRT_FLEXPWM2_MOD1_TRIG_DUTY
    .trig_val = 2,
#else
    .trig_val = 0,
#endif
#else
    .trig_val = 0,
#endif
    .out_a =
    {
      .used = true,
      .pin = GPIO_FLEXPWM2_MOD1_A
    },
#ifdef CONFIG_IMXRT_FLEXPWM2_MOD1_USE_OUT_B
    .out_b =
    {
      .used = true,
      .pin = GPIO_FLEXPWM2_MOD1_B
    },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM2_MOD1_COMP
    .complementary = true,
#else
    .complementary = false,
#endif
    .sync_src = CONFIG_IMXRT_FLEXPWM2_MOD1_SYNC_SRC,
    .ext_sync = IMXRT_XBARA1_OUT_FLEXPWM2_EXT_SYNC0_SEL_OFFSET,
  },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM2_MOD2
  {
    .module = 2,
    .used = true,
#ifdef CONFIG_IMXRT_FLEXPWM2_MOD2_TRIG
#ifdef CONFIG_IMXRT_FLEXPWM2_MOD2_TRIG_PER
    .trig_val = 1,
#elif CONFIG_IMXRT_FLEXPWM2_MOD2_TRIG_DUTY
    .trig_val = 2,
#else
    .trig_val = 0,
#endif
#else
    .trig_val = 0,
#endif
    .out_a =
    {
      .used = true,
      .pin = GPIO_FLEXPWM2_MOD2_A,
    },
#ifdef CONFIG_IMXRT_FLEXPWM2_MOD2_USE_OUT_B
    .out_b =
    {
      .used = true,
      .pin = GPIO_FLEXPWM2_MOD2_B
    },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM2_MOD2_COMP
    .complementary = true,
#else
    .complementary = false,
#endif
    .sync_src = CONFIG_IMXRT_FLEXPWM2_MOD2_SYNC_SRC,
    .ext_sync = IMXRT_XBARA1_OUT_FLEXPWM2_EXT_SYNC1_SEL_OFFSET,
  },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM2_MOD3
  {
    .module = 3,
    .used = true,
#ifdef CONFIG_IMXRT_FLEXPWM2_MOD3_TRIG
#ifdef CONFIG_IMXRT_FLEXPWM2_MOD3_TRIG_PER
    .trig_val = 1,
#elif CONFIG_IMXRT_FLEXPWM2_MOD3_TRIG_DUTY
    .trig_val = 2,
#else
    .trig_val = 0,
#endif
#else
    .trig_val = 0,
#endif
    .out_a =
    {
      .used = true,
      .pin = GPIO_FLEXPWM2_MOD3_A
    },
#ifdef CONFIG_IMXRT_FLEXPWM2_MOD3_USE_OUT_B
    .out_b =
    {
      .used = true,
      .pin = GPIO_FLEXPWM2_MOD3_B
    },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM2_MOD3_COMP
    .complementary = true,
#else
    .complementary = false,
#endif
    .sync_src = CONFIG_IMXRT_FLEXPWM2_MOD3_SYNC_SRC,
    .ext_sync = IMXRT_XBARA1_OUT_FLEXPWM2_EXT_SYNC2_SEL_OFFSET,
  },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM2_MOD4
  {
    .module = 4,
    .used = true,
#ifdef CONFIG_IMXRT_FLEXPWM2_MOD4_TRIG
#ifdef CONFIG_IMXRT_FLEXPWM2_MOD4_TRIG_PER
    .trig_val = 1,
#elif CONFIG_IMXRT_FLEXPWM2_MOD4_TRIG_DUTY
    .trig_val = 2,
#else
    .trig_val = 0,
#endif
#else
    .trig_val = 0,
#endif
    .out_a =
    {
      .used = true,
      .pin = GPIO_FLEXPWM2_MOD4_A
    },
#ifdef CONFIG_IMXRT_FLEXPWM2_MOD4_USE_OUT_B
    .out_b =
    {
      .used = true,
      .pin = GPIO_FLEXPWM2_MOD4_B
    },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM2_MOD4_COMP
    .complementary = true,
#else
    .complementary = false,
#endif
    .sync_src = CONFIG_IMXRT_FLEXPWM2_MOD4_SYNC_SRC,
    .ext_sync = IMXRT_XBARA1_OUT_FLEXPWM2_EXT_SYNC3_SEL_OFFSET,
  }
#endif
};

static struct imxrt_flexpwm_s g_pwm2 =
{
  .ops = &g_pwmops,
  .modules = g_pwm2_modules,
  .modules_num = FLEXPWM2_NMODULES,
  .frequency = 0,
  .base = IMXRT_FLEXPWM2_BASE,
};
#endif /* CONFIG_IMXRT_FLEXPWM2 */

#ifdef CONFIG_IMXRT_FLEXPWM3

static struct imxrt_flexpwm_module_s g_pwm3_modules[] =
{
  /* FlexPWM3 has 4 submodules with 2 outputs for each */

#ifdef CONFIG_IMXRT_FLEXPWM3_MOD1
  {
    .module = 1,
    .used = true,
#ifdef CONFIG_IMXRT_FLEXPWM3_MOD1_TRIG
#ifdef CONFIG_IMXRT_FLEXPWM3_MOD1_TRIG_PER
    .trig_val = 1,
#elif CONFIG_IMXRT_FLEXPWM3_MOD1_TRIG_DUTY
    .trig_val = 2,
#else
    .trig_val = 0,
#endif
#else
    .trig_val = 0,
#endif
    .out_a =
    {
      .used = true,
      .pin = GPIO_FLEXPWM3_MOD1_A
    },
#ifdef CONFIG_IMXRT_FLEXPWM3_MOD1_USE_OUT_B
    .out_b =
    {
      .used = true,
      .pin = GPIO_FLEXPWM3_MOD1_B
    },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM3_MOD1_COMP
    .complementary = true,
#else
    .complementary = false,
#endif
    .sync_src = CONFIG_IMXRT_FLEXPWM3_MOD1_SYNC_SRC,
    .ext_sync = IMXRT_XBARA1_OUT_FLEXPWM3_EXT_SYNC0_SEL_OFFSET,
  },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM3_MOD2
  {
    .module = 2,
    .used = true,
#ifdef CONFIG_IMXRT_FLEXPWM3_MOD2_TRIG
#ifdef CONFIG_IMXRT_FLEXPWM3_MOD2_TRIG_PER
    .trig_val = 1,
#elif CONFIG_IMXRT_FLEXPWM3_MOD2_TRIG_DUTY
    .trig_val = 2,
#else
    .trig_val = 0,
#endif
#else
    .trig_val = 0,
#endif
    .out_a =
    {
      .used = true,
      .pin = GPIO_FLEXPWM3_MOD2_A
    },
#ifdef CONFIG_IMXRT_FLEXPWM3_MOD2_USE_OUT_B
    .out_b =
    {
      .used = true,
      .pin = GPIO_FLEXPWM3_MOD2_B
    },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM3_MOD2_COMP
    .complementary = true,
#else
    .complementary = false,
#endif
    .sync_src = CONFIG_IMXRT_FLEXPWM3_MOD2_SYNC_SRC,
    .ext_sync = IMXRT_XBARA1_OUT_FLEXPWM3_EXT_SYNC1_SEL_OFFSET,
  },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM3_MOD3
  {
    .module = 3,
    .used = true,
#ifdef CONFIG_IMXRT_FLEXPWM3_MOD3_TRIG
#ifdef CONFIG_IMXRT_FLEXPWM3_MOD3_TRIG_PER
    .trig_val = 1,
#elif CONFIG_IMXRT_FLEXPWM3_MOD3_TRIG_DUTY
    .trig_val = 2,
#else
    .trig_val = 0,
#endif
#else
    .trig_val = 0,
#endif
    .out_a =
    {
      .used = true,
      .pin = GPIO_FLEXPWM3_MOD3_A
    },
#ifdef CONFIG_IMXRT_FLEXPWM3_MOD3_USE_OUT_B
    .out_b =
    {
      .used = true,
      .pin = GPIO_FLEXPWM3_MOD3_B
    },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM3_MOD3_COMP
    .complementary = true,
#else
    .complementary = false,
#endif
    .sync_src = CONFIG_IMXRT_FLEXPWM3_MOD3_SYNC_SRC,
    .ext_sync = IMXRT_XBARA1_OUT_FLEXPWM3_EXT_SYNC2_SEL_OFFSET,
  },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM3_MOD4
  {
    .module = 4,
    .used = true,
#ifdef CONFIG_IMXRT_FLEXPWM3_MOD4_TRIG
#ifdef CONFIG_IMXRT_FLEXPWM3_MOD4_TRIG_PER
    .trig_val = 1,
#elif CONFIG_IMXRT_FLEXPWM3_MOD4_TRIG_DUTY
    .trig_val = 2,
#else
    .trig_val = 0,
#endif
#else
    .trig_val = 0,
#endif
    .out_a =
    {
      .used = true,
      .pin = GPIO_FLEXPWM3_MOD4_A
    },
#ifdef CONFIG_IMXRT_FLEXPWM3_MOD4_USE_OUT_B
    .out_b =
    {
      .used = true,
      .pin = GPIO_FLEXPWM3_MOD4_B
    },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM3_MOD4_COMP
    .complementary = true,
#else
    .complementary = false,
#endif
    .sync_src = CONFIG_IMXRT_FLEXPWM3_MOD4_SYNC_SRC,
    .ext_sync = IMXRT_XBARA1_OUT_FLEXPWM3_EXT_SYNC3_SEL_OFFSET,
  },
#endif
};

static struct imxrt_flexpwm_s g_pwm3 =
{
  .ops = &g_pwmops,
  .modules = g_pwm3_modules,
  .modules_num = FLEXPWM3_NMODULES,
  .frequency = 0,
  .base = IMXRT_FLEXPWM3_BASE,
};
#endif /* CONFIG_IMXRT_FLEXPWM3 */

