apache/nuttx/arch/arm/src/imxrt/imxrt_flexpwm.c
#ifdef CONFIG_IMXRT_FLEXPWM4

static struct imxrt_flexpwm_module_s g_pwm4_modules[] =
{
  /* FlexPWM4 has 4 submodules with 2 outputs for each */

#ifdef CONFIG_IMXRT_FLEXPWM4_MOD1
  {
    .module = 1,
    .used = true,
#ifdef CONFIG_IMXRT_FLEXPWM4_MOD1_TRIG
#ifdef CONFIG_IMXRT_FLEXPWM4_MOD1_TRIG_PER
    .trig_val = 1,
#elif CONFIG_IMXRT_FLEXPWM4_MOD1_TRIG_DUTY
    .trig_val = 2,
#else
    .trig_val = 0,
#endif
#else
    .trig_val = 0,
#endif
    .out_a =
    {
      .used = true,
      .pin = GPIO_FLEXPWM4_MOD1_A
    },
#ifdef CONFIG_IMXRT_FLEXPWM4_MOD1_USE_OUT_B
    .out_b =
    {
      .used = true,
      .pin = GPIO_FLEXPWM4_MOD1_B
    },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM4_MOD1_COMP
    .complementary = true,
#else
    .complementary = false,
#endif
    .sync_src = CONFIG_IMXRT_FLEXPWM4_MOD1_SYNC_SRC,
    .ext_sync = IMXRT_XBARA1_OUT_FLEXPWM4_EXT_SYNC0_SEL_OFFSET,
  },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM4_MOD2
  {
    .module = 2,
    .used = true,
#ifdef CONFIG_IMXRT_FLEXPWM4_MOD2_TRIG
#ifdef CONFIG_IMXRT_FLEXPWM4_MOD2_TRIG_PER
    .trig_val = 1,
#elif CONFIG_IMXRT_FLEXPWM4_MOD2_TRIG_DUTY
    .trig_val = 2,
#else
    .trig_val = 0,
#endif
#else
    .trig_val = 0,
#endif
    .out_a =
    {
      .used = true,
      .pin = GPIO_FLEXPWM4_MOD2_A
    },
#ifdef CONFIG_IMXRT_FLEXPWM4_MOD2_USE_OUT_B
    .out_b =
    {
      .used = true,
      .pin = GPIO_FLEXPWM4_MOD2_B
    },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM4_MOD2_COMP
    .complementary = true,
#else
    .complementary = false,
#endif
    .sync_src = CONFIG_IMXRT_FLEXPWM4_MOD2_SYNC_SRC,
    .ext_sync = IMXRT_XBARA1_OUT_FLEXPWM4_EXT_SYNC1_SEL_OFFSET,
  },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM4_MOD3
  {
    .module = 3,
    .used = true,
#ifdef CONFIG_IMXRT_FLEXPWM4_MOD3_TRIG
#ifdef CONFIG_IMXRT_FLEXPWM4_MOD3_TRIG_PER
    .trig_val = 1,
#elif CONFIG_IMXRT_FLEXPWM4_MOD3_TRIG_DUTY
    .trig_val = 2,
#else
    .trig_val = 0,
#endif
#else
    .trig_val = 0,
#endif
    .out_a =
    {
      .used = true,
      .pin = GPIO_FLEXPWM4_MOD3_A
    },
#ifdef CONFIG_IMXRT_FLEXPWM4_MOD3_USE_OUT_B
    .out_b =
    {
      .used = true,
      .pin = GPIO_FLEXPWM4_MOD3_B
    },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM4_MOD3_COMP
    .complementary = true,
#else
    .complementary = false,
#endif
    .sync_src = CONFIG_IMXRT_FLEXPWM4_MOD3_SYNC_SRC,
    .ext_sync = IMXRT_XBARA1_OUT_FLEXPWM4_EXT_SYNC3_SEL_OFFSET,
  },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM4_MOD4
  {
    .module = 4,
    .used = true,
#ifdef CONFIG_IMXRT_FLEXPWM4_MOD4_TRIG
#ifdef CONFIG_IMXRT_FLEXPWM4_MOD4_TRIG_PER
    .trig_val = 1,
#elif CONFIG_IMXRT_FLEXPWM4_MOD4_TRIG_DUTY
    .trig_val = 2,
#else
    .trig_val = 0,
#endif
#else
    .trig_val = 0,
#endif
    .out_a =
    {
      .used = true,
      .pin = GPIO_FLEXPWM4_MOD4_A
    },
#ifdef CONFIG_IMXRT_FLEXPWM4_MOD4_USE_OUT_B
    .out_b =
    {
      .used = true,
      .pin = GPIO_FLEXPWM4_MOD4_B
    },
#endif
#ifdef CONFIG_IMXRT_FLEXPWM4_MOD3_COMP
    .complementary = true,
#else
    .complementary = false,
#endif
    .sync_src = CONFIG_IMXRT_FLEXPWM4_MOD4_SYNC_SRC,
    .ext_sync = IMXRT_XBARA1_OUT_FLEXPWM4_EXT_SYNC4_SEL_OFFSET,
  },
#endif
};

static struct imxrt_flexpwm_s g_pwm4 =
{
  .ops = &g_pwmops,
  .modules = g_pwm4_modules,
  .modules_num = FLEXPWM4_NMODULES,
  .frequency = 0,
  .base = IMXRT_FLEXPWM4_BASE,
};
#endif /* CONFIG_IMXRT_FLEXPWM4 */

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: pwm_change_freq
 *
 * Description:
 *   Set timer frequency and change registers value to respect that
 *   frequency.
 *
 * Input Parameters:
 *   dev  - A reference to the lower half PWM driver state structure
 *   info - A reference to the characteristics of the pulsed output
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int pwm_change_freq(struct pwm_lowerhalf_s *dev,
                           const struct pwm_info_s *info,
                           uint8_t channel)
{
  struct imxrt_flexpwm_s *priv = (struct imxrt_flexpwm_s *)dev;
  uint8_t shift = (info->channels[channel].channel - 1) >> 1;
  uint16_t regval;
  uint16_t olddiv = getreg16(priv->base + IMXRT_FLEXPWM_SM0VAL1_OFFSET
                                        + MODULE_OFFSET * shift);
  uint32_t newdiv = (CLK_FREQ + (info->frequency / 2)) / info->frequency;
  uint16_t prescale = 0;

  while (newdiv > PWM_RES && prescale < 7)
    {
      newdiv = (newdiv + 1) >> 1;
      prescale++;
    }

  if (newdiv > PWM_RES)
    {
      newdiv = PWM_RES;
    }
  else if (newdiv < 2)
    {
      newdiv = 2;
    }

  regval = getreg16(priv->base + IMXRT_FLEXPWM_MCTRL_OFFSET);
  regval |= MCTRL_CLDOK(1 << shift);
  putreg16(regval, priv->base + IMXRT_FLEXPWM_MCTRL_OFFSET);

  regval = SMCTRL_FULL | SMCTRL_PRSC(prescale);
  putreg16(regval, priv->base + IMXRT_FLEXPWM_SM0CTRL_OFFSET
                              + MODULE_OFFSET * shift);

  putreg16(newdiv - 1, priv->base + IMXRT_FLEXPWM_SM0VAL1_OFFSET
                              + MODULE_OFFSET * shift);

  /* Update VAL0, VAL3 and VAL5 registers */

  regval = getreg16(priv->base + IMXRT_FLEXPWM_SM0VAL0_OFFSET
                               + MODULE_OFFSET * shift);
  regval = regval * newdiv / olddiv;
  putreg16(regval, priv->base + IMXRT_FLEXPWM_SM0VAL0_OFFSET
                              + MODULE_OFFSET * shift);

  regval = getreg16(priv->base + IMXRT_FLEXPWM_SM0VAL3_OFFSET
                               + MODULE_OFFSET * shift);
  regval = regval * newdiv / olddiv;
  putreg16(regval, priv->base + IMXRT_FLEXPWM_SM0VAL3_OFFSET
                              + MODULE_OFFSET * shift);

  regval = getreg16(priv->base + IMXRT_FLEXPWM_SM0VAL5_OFFSET
                               + MODULE_OFFSET * shift);
  regval = regval * newdiv / olddiv;
  putreg16(regval, priv->base + IMXRT_FLEXPWM_SM0VAL5_OFFSET
                              + MODULE_OFFSET * shift);

  return OK;
}

/****************************************************************************
 * Name: pwm_set_output
 *
 * Description:
 *   Set duty cycle and enable PWM output.
 *
 * Input Parameters:
 *   dev     - A reference to the lower half PWM driver state structure
 *   channel - Channel to by updated
 *   duty    - New duty
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int pwm_set_output(struct pwm_lowerhalf_s *dev, uint8_t channel,
                          ub16_t duty)
{
  struct imxrt_flexpwm_s *priv = (struct imxrt_flexpwm_s *)dev;
  uint16_t period;
  uint16_t width;
  uint16_t regval;
  uint8_t shift = (channel - 1) >> 1;  /* Shift submodule offset addresses */

